#include<stdio.h>
//一维数组的输入/输出
// int main()
// {
//     int a[5];
//     int i;
//     printf("请输入数值");
//     for(i = 0;i<5;i++)
//     scanf("%d",&a[i]);//想循环中依次输入数组中的a[0]~a[4]
//     for(i = 0;i<5;i++)
//     printf("%d",a[i]);//用控制数组输出
// printf("\n");
// }
//可以查找一维整数中部分元素的值
// int main()
// {
//     int i,x,y,n = 0,a[12] = {5,6,7,8,9,10,11,12,13,14,6,6};
//     printf("请查找需要寻找的数据类型");
//     scanf("%d%d",&x,&y);
//     if(x==y)    //如果相同那么就不做更换
//     {
//         printf("两个相同，数组仍然保持原样");
//         return 0;
//     }
//     for (i=0;i<12;i++) //反复检查数组
//     {
//        if(a[i]==x) //查找数组的数据
//        {
//         a[i]=y;   //修改数组数据，在这里替换
//         n++; //会用于自动计数
//     printf("%d\n",a[i]); 
//        } 
//        printf("%d\n",a[i]); //打印出这个数组里的所有数据,一次只打印一个数顺序按照a[n]的顺序
//     }
//     if(n>0) //如果存在这个数组那么至少n会大于一
//        printf("有%d个元素被置换\n",n);
//     else
//        printf("数组中没有找到%d\n",x);
    

// }

//计算两个整形的整型是否相同
// int main()
// #define N 6
// #define M 6 //创建宏定义，可以直接规定NM的长度为6
// {
//     int i,a[N] = {5,6,7,8,9,10}, b[M]={8,6,7,8,11,12};
//     if(N!=M)
//     {
//         printf("这两个数组不相等\n");
//         return 0;
//     }
//     for(i = 0;i<=5;i++){
//      if(a[i]!=b[i]){  //如果两个数组有不相等的就跳出循环，可以检验两个程序是否相等,
//      break;
//      }
//      if (i>5) //这个计数器只能标记是否相同，不能反应相同的数量
//      printf("这两个数组相等");
//      else
//      printf("这两个数组不相等\n");
//     }
//     printf("相同的数组为%d\n",i);
// }

 //
int main()
{

    

}